In [ ]:
%run py_import.py

In [3]:
frame = pd.DataFrame(np.random.randn(4,3),columns = list('bde'),index = ['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah    0.153616 -0.798606  0.294706
Ohio   -0.041883 -2.375891 -0.010597
Texas   0.187567 -1.054483  1.885638
Oregon -0.674098 -1.323118  0.165349

In [4]:
np.abs(frame)  # Numpy通用函数对pandas对象也有效，abs：取绝对值

               b         d         e
Utah    0.153616  0.798606  0.294706
Ohio    0.041883  2.375891  0.010597
Texas   0.187567  1.054483  1.885638
Oregon  0.674098  1.323118  0.165349

In [9]:
f = lambda x:x.max() - x.min()
frame.apply(f)   # 每列上面最大值-最小值，apply是对行或者列进行操作

b    0.861665
d    1.577285
e    1.896234
dtype: float64

In [10]:
frame.apply(f, axis = 'columns')

Utah      1.093312
Ohio      2.365295
Texas     2.940121
Oregon    1.488467
dtype: float64

In [11]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ['min','max'])
frame.apply(f)

            b         d         e
min -0.674098 -2.375891 -0.010597
max  0.187567 -0.798606  1.885638

In [12]:
format = lambda x:'%.2f'%x
frame.applymap(format)  # applymap对每一个数据进行操作

            b      d      e
Utah     0.15  -0.80   0.29
Ohio    -0.04  -2.38  -0.01
Texas    0.19  -1.05   1.89
Oregon  -0.67  -1.32   0.17

In [13]:
frame['e'].map(format)

Utah       0.29
Ohio      -0.01
Texas      1.89
Oregon     0.17
Name: e, dtype: object